Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCM100.PIC
      <edc:SFRDef edc:_addr="0x1F82B270" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INT1TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INT1TMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTTMR" edc:mask="0xffffffff" edc:name="INTTMR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B280" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INT1HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INT1HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTHLD" edc:mask="0xffffffff" edc:name="INTHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B290" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDX1CNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INDX1CNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDXCNT" edc:mask="0xffffffff" edc:name="INDXCNT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B2A0" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDX1HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INDX1HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDXHLD" edc:mask="0xffffffff" edc:name="INDXHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B2B0" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI1ICC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI1ICC" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEIICC" edc:mask="0xffffffff" edc:name="QEIICC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B2C0" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI1CMPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI1CMPL" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEICMPL" edc:mask="0xffffffff" edc:name="QEICMPL" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F82B2D0" edc:offset="0x130"/>
      <edc:SFRDef edc:_addr="0x1F82B400" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="2" edc:access="----------------n-nnnnnn-nnnn-nn" edc:cname="QEI2CON" edc:desc="" edc:impl="0xbf7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-000000-0000-00" edc:name="QEI2CON" edc:nzwidth="32" edc:por="----------------0-000000-0000-00" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCM" edc:mask="0x3" edc:name="CCM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GATEN" edc:desc="" edc:mask="0x1" edc:name="GATEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNTPOL" edc:desc="" edc:mask="0x1" edc:name="CNTPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INTDIV" edc:desc="" edc:mask="0x7" edc:name="INTDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PIMOD" edc:desc="" edc:mask="0x7" edc:name="PIMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="QEIEN" edc:desc="" edc:mask="0x1" edc:name="QEIEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82B410" edc:_begin="0x0" edc:_end="0xd0" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="2" edc:access="---------------nnnnnnnnnnnnnrrrr" edc:cname="QEI2IOC" edc:desc="" edc:impl="0x1ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0000000000000xxxx" edc:name="QEI2IOC" edc:nzwidth="32" edc:por="---------------0000000000000xxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA" edc:mask="0x1" edc:name="QEA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEB" edc:mask="0x1" edc:name="QEB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INDEX" edc:mask="0x1" edc:name="INDEX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOME" edc:mask="0x1" edc:name="HOME" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEAPOL" edc:mask="0x1" edc:name="QEAPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEBPOL" edc:mask="0x1" edc:name="QEBPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPOL" edc:mask="0x1" edc:name="IDXPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOMPOL" edc:mask="0x1" edc:name="HOMPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWPAB" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTFNC" edc:mask="0x3" edc:name="OUTFNC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QFDIV" edc:mask="0x7" edc:name="QFDIV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FLTREN" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QCAPEN" edc:mask="0x1" edc:name="QCAPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCAPEN" edc:mask="0x1" edc:name="HCAPEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
